app/views/welcome/index.html.haml

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 13]]
---
			-array = []
			-@user.tweets.each do |tweet|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
								%span.card-title
									= link_to tweet.user.last_name + tweet.user.first_name, user_path(tweet.user)

SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = $1  [["tweet_id", 11]]
SELECT "users".* FROM "users" INNER JOIN "followings" ON "users"."id" = "followings"."followee_id" WHERE "followings"."follower_id" = $1  [["follower_id", 2]]
---
								%a.btn.waves-effect.waves-light.orange{:href => "/tweets/#{tweet.id}/like"}
									= tweet.likes.count
									Likes
								- if tweet.user.followers.include?(@user)