app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @user = User.find(params[:id])

UPDATE "users" SET "righthanded" = $1, "double_handed_backhand" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["righthanded", "f"], ["double_handed_backhand", "f"], ["updated_at", "2017-07-01 12:50:44.678819"], ["id", 1]]
---
  def update
    @user = current_user
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE (username LIKE '陳' or first_name LIKE '陳' or last_name LIKE '陳' or email LIKE '陳')
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
---
  def find
    @q = params[:query]
    @user = User.where("username LIKE ? or email LIKE ?", @q, @q)
    # @user = User.find_by(username: params[:query])
    if @user.present?